app/Http/Controllers/Auth/RegisterController.php

insert into `users` (`name`, `email`, `password`, `updated_at`, `created_at`) values ('wrqrq', 'yakhiyaevleel@gmail.com', '$2y$10$YV1y1aHmO.5sSJqQzTMlZ.X9xgNfTAc3dqeT3YxweJXDW8tAVIpMW', '2025-07-06 21:08:09', '2025-07-06 21:08:09')
---
    public function register(Request $request)
    {
        $request->validate([
            'name'     => 'required|string|max:255',
            'email'    => 'required|string|email|max:255|unique:users',
            'password' => 'required|string|min:6|confirmed',
        ]);

        $user = User::create([
            'name'     => $request->name,
            'email'    => $request->email,
            'password' => Hash::make($request->password),
        ]);