app/Http/Controllers/BookingController.php

select * from `hotels` where `hotels`.`id` = 'movie.ogg' limit 1
---
    public function create($hotelId)
    {
        $hotel = Hotel::findOrFail($hotelId);