app/Http/Controllers/CityController.php

    public function getCities($countryId)
    {
        $cities = City::where('country_id', $countryId)->get(['id', 'name']);
---
select `id`, `name` from `cities` where `country_id` = '1'