app/Http/Controllers/HotelController.php

select * from `countries`
select * from `hotels`
---
    public function hotel()
    {
        $countries = Country::all();
        $hotels = Hotel::all();

select * from `hotels` where `country_id` = '2' and `city_id` = '2'
---
    public function search(Request $request)
    {
        $query = Hotel::query();

        if ($request->filled('country_id')) {
            $query->where('country_id', $request->country_id);
        }

        if ($request->filled('city_id')) {
            $query->where('city_id', $request->city_id);

select * from `countries`
---
        ]);

        $filteredHotels = $query->get();
        $countries = Country::all();